{
  "date": "2025-12-31",
  "language": "et",
  "title": "LIISA JA PEETER TELK",
  "generatedAt": "2025-12-30T23:05:44.423Z",
  "characters": [
    {
      "id": "char1",
      "name": "LIISA",
      "type": "human",
      "description": "Väike inimene, tüdruk punaste põskedega, heledad juuksed kahe patsi. Seljas roosa pikkade varrukatega pluus ja sinised püksid. Tal on rõõmus ja uudishimulik näoilme. Armas multifilmistiil.",
      "image": "char1.png"
    },
    {
      "id": "char2",
      "name": "PEETER",
      "type": "human",
      "description": "Väike inimene, poiss lühikeste pruunide juustega. Seljas sinine pikkade varrukatega pluus ja rohelised püksid. Tal on sõbralik ja entusiastlik näoilme. Armas multifilmistiil.",
      "image": "char2.png"
    }
  ],
  "locations": [
    {
      "id": "loc1",
      "name": "LIISA JA PEETER TUBA",
      "description": "Cozy children's room with light yellow walls, a soft light blue rug on the wooden floor. There is a single large window on the back wall showing a gentle snowy winter evening with a few bare trees visible outside. A small, simple wooden bookshelf is against the left wall. A soft, warm lamp light glows from a small lamp on a bedside table in the corner. Cartoon style.",
      "image": "loc1.png"
    }
  ],
  "pages": [
    {
      "pageNumber": 1,
      "text": "LIISA JA PEETER MÄNGIVAD.",
      "scene": "Liisa and Peeter are playing with colorful building blocks on the soft light blue rug in the center of the cozy children's room. They are sitting on the floor, smiling and engaged. The room has light yellow walls, a single large window on the back wall showing a snowy winter evening, a small wooden bookshelf on the left wall, and a soft lamp light. Both children wear their consistent clothing.",
      "image": "page1.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 2,
      "text": "NEIL ON SUUR MÕTE.",
      "scene": "Liisa and Peeter look at each other with bright, excited smiles, their eyes wide with a new idea. They are still sitting on the light blue rug, surrounded by their building blocks in the cozy children's room. The room has light yellow walls, a single large window on the back wall showing a snowy winter evening, a small wooden bookshelf on the left wall, and a soft lamp light. Both children wear their consistent clothing.",
      "image": "page2.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 3,
      "text": "NAD TOOVAD TEKE.",
      "scene": "Liisa and Peeter are cheerfully pulling a large, soft blue blanket from a wicker basket near the corner of the cozy children's room. They are both holding parts of the blanket, looking eager. The room has light yellow walls, a soft light blue rug, a single large window on the back wall showing a snowy winter evening, a small wooden bookshelf on the left wall, and a soft lamp light. Both children wear their consistent clothing.",
      "image": "page3.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 4,
      "text": "NAD TOOVAD PADI.",
      "scene": "Liisa and Peeter are now carrying several soft, colorful pillows in their arms, walking towards the center of the room where the blue blanket is starting to be laid out on the light blue rug. They are smiling. The cozy children's room has light yellow walls, a single large window on the back wall showing a snowy winter evening, a small wooden bookshelf on the left wall, and a soft lamp light. Both children wear their consistent clothing.",
      "image": "page4.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 5,
      "text": "NAD EHITAVAD TELKI.",
      "scene": "Liisa and Peeter are busily constructing a small fort or tent in the center of the room, using the blue blanket draped over two small, simple wooden chairs. Pillows are being placed inside the fort on the light blue rug. They are focused and collaborating on their project. The cozy children's room has light yellow walls, a single large window on the back wall showing a snowy winter evening, a small wooden bookshelf on the left wall, and a soft lamp light. Both children wear their consistent clothing.",
      "image": "page5.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 6,
      "text": "TELK ON VALMIS!",
      "scene": "Liisa and Peeter stand proudly next to their newly built cozy tent/fort in the center of the room. The blue blanket is neatly draped over two small chairs, forming an inviting enclosed space with colorful pillows inside on the light blue rug. They are both smiling brightly at their creation. The cozy children's room has light yellow walls, a single large window on the back wall showing a snowy winter evening, a small wooden bookshelf on the left wall, and a soft lamp light. Both children wear their consistent clothing.",
      "image": "page6.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 7,
      "text": "NAD TOOVAD RAAMATU.",
      "scene": "Peeter is carefully selecting a colorful picture book from the small wooden bookshelf on the left wall of the cozy children's room. Liisa stands next to him, pointing at a book with a happy expression. The finished tent is visible in the background in the center of the room. The room has light yellow walls, a soft light blue rug, a single large window on the back wall showing a snowy winter evening, and a soft lamp light. Both children wear their consistent clothing.",
      "image": "page7.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 8,
      "text": "NAD ISTUVAD TELGIS.",
      "scene": "Liisa and Peeter are sitting comfortably inside their cozy tent/fort, nestled amongst the colorful pillows on the light blue rug. The blue blanket forms the walls of their private space. They are both looking at the picture book together. The cozy children's room's light yellow walls and soft lamp light are visible around the tent. The window shows the snowy winter evening. Both children wear their consistent clothing.",
      "image": "page8.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 9,
      "text": "NAD VAATAVAD PILTE.",
      "scene": "Liisa and Peeter are completely engrossed, pointing at the vibrant pictures in the book they are sharing. They are still sitting side-by-side inside their cozy tent/fort, which is made from a blue blanket and pillows. Their faces show wonder and enjoyment. The cozy children's room's light yellow walls and soft lamp light are visible around the tent. The window shows the snowy winter evening. Both children wear their consistent clothing.",
      "image": "page9.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 10,
      "text": "LIISA JA PEETER ON RÕÕMSAD.",
      "scene": "Liisa and Peeter are smiling warmly, snuggled together in their cozy tent/fort, which is made from a blue blanket and pillows. The picture book is open on their laps, showing happy illustrations. They look content and happy. The cozy children's room's light yellow walls, soft light blue rug, and the snowy winter evening visible through the window complete the warm scene. The soft lamp light adds to the cozy atmosphere. Both children wear their consistent clothing.",
      "image": "page10.png",
      "location_id": "loc1"
    }
  ]
}