{
  "date": "2025-12-28",
  "language": "et",
  "title": "KAAREL JA REINU JÄÄLATERNA",
  "generatedAt": "2025-12-27T17:11:19.871Z",
  "characters": [
    {
      "id": "char1",
      "name": "KAAREL",
      "type": "bear",
      "description": "Väike pruun karu, seljas soe sinine talvemantel ja punane sall, peas sinine müts, sõbralik ja uudishimulik näoilme. Armas multifilmistiil.",
      "image": "char1.png"
    },
    {
      "id": "char2",
      "name": "REINU",
      "type": "fox",
      "description": "Väike oranž rebane, seljas roheline vest ja oranž müts, valge sabaots, säravad silmad ja rõõmus näoilme. Armas multifilmistiil.",
      "image": "char2.png"
    }
  ],
  "locations": [
    {
      "id": "loc1",
      "name": "LUMINE ÕUEALA",
      "description": "Lumine õueala talvel, väike hubane puidust majake taustal lumise katusega, akendest kumab soe valgus. Mõned lumised kuused ja põõsad ümberringi, kaetud õrna lumekihiga. Maapind on kaetud paksu puhta lumega. Selge talvine päev sinise taevaga. Armas multifilmistiil.",
      "image": "loc1.png"
    }
  ],
  "pages": [
    {
      "pageNumber": 1,
      "text": "KAAREL JA REINU MÄNGIVAD.",
      "scene": "Kaarel, väike pruun karu sinises talvemantlis ja Reinu, väike oranž rebane rohelises vestis, mängivad rõõmsalt lumisel õuealal. Nad seisavad sügavas lumes ja naeratavad. Majake on taustal, selle lumiselt katuselt langeb õrnalt lund. Selge talvine päev. Armas multifilmistiil.",
      "image": "page1.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 2,
      "text": "NEIL ON HEA MÕTE.",
      "scene": "Kaarel ja Reinu seisavad lumisel õuealal, vaadates üksteisele otsa säravate silmadega. Kaarel tõstab oma käpa õhku, nagu tal oleks äsja idee tulnud. Reinu noogutab innukalt. Taustal on lumine majake. Armas multifilmistiil.",
      "image": "page2.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 3,
      "text": "NAD VÕTAVAD VETT.",
      "scene": "Kaarel ja Reinu on lumisel õuealal. Kaarel hoiab väikeses ämbris vett. Reinu seisab tema kõrval ja vaatab uudishimulikult ämbrisse. Majake paistab taustal. Armas multifilmistiil.",
      "image": "page3.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 4,
      "text": "NAD VALAVAD KAUSSI.",
      "scene": "Kaarel hoiab ettevaatlikult ämbrit ja valab vett suurde läbipaistvasse kaussi, mis seisab lumel. Reinu jälgib tähelepanelikult, olles Kaarli kõrval. Lumine majake on taustal. Armas multifilmistiil.",
      "image": "page4.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 5,
      "text": "KÜLM TEHA JÄÄD.",
      "scene": "Kaarel ja Reinu seisavad lumisel õuealal, vaadates kaussi, kus vesi nüüd seisab. Ümberringi on paks lumi ja karge õhk. Kaarel on mähitud mantlisse, Reinu sabal on lund. Taustal on lumine majake. Armas multifilmistiil.",
      "image": "page5.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 6,
      "text": "NAD OOTAVAD HOOLIKALT.",
      "scene": "Kaarel ja Reinu istuvad lumel kausi kõrval. Nad vaatavad kannatlikult kaussi, kus vesi hakkab jäätuma. Nende näoilmed on ootusärevad. Majake seisab taustal, lumehelbed langevad õrnalt. Armas multifilmistiil.",
      "image": "page6.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 7,
      "text": "NÜÜD ON JÄÄ VALMIS.",
      "scene": "Kaarel ja Reinu vaatavad rõõmsalt kaussi, mis on nüüd täis läbipaistvat jääd. Kaarel osutab jäätunud veele. Reinu naeratab laialt. Majake taustal. Armas multifilmistiil.",
      "image": "page7.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 8,
      "text": "NAD VÕTAVAD JÄÄLATERNA.",
      "scene": "Kaarel ja Reinu tõstavad lumelt ettevaatlikult ümmarguse jäälaterna, mis on kausist välja võetud. Jää on ilus ja läbipaistev. Nad hoiavad seda õrnalt kahekesi. Lumine majake on taustal. Armas multifilmistiil.",
      "image": "page8.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 9,
      "text": "SEE SÄRAB ILUSASTI.",
      "scene": "Jäälaterna särab soojalt, kuna selle sees põleb väike küünal (ohutult asetatud, latern on piisavalt paks). Kaarel ja Reinu vaatavad laternat imetlusega, nende näod on valgustatud laterna pehmest kumast. On hämar õhtu. Majake taustal. Armas multifilmistiil.",
      "image": "page9.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 10,
      "text": "KAAREL JA REINU ON ÕNNELIKUD.",
      "scene": "Kaarel ja Reinu seisavad lumisel õuealal, latern nende ees särades. Nad naeratavad õnnelikult ja vaatavad laternat, mis valgustab kaunist talveõhtut. Majake taustal. Armas multifilmistiil.",
      "image": "page10.png",
      "location_id": "loc1"
    }
  ]
}