{
  "date": "2025-12-28",
  "language": "et",
  "title": "MARI JA PEETRI VÄRVILISED KETID",
  "generatedAt": "2025-12-27T16:26:12.741Z",
  "characters": [
    {
      "id": "char1",
      "name": "MARI",
      "type": "human",
      "description": "Väike inimene, tüdruk. Mari on rõõmsameelne tüdruk, kellel on blondid patsikesed punaste paeltega. Tal on seljas roosa pluus ja sinised traksipüksid. Tema suured, sõbralikud silmad ja naeratav nägu peegeldavad uudishimu. Armas multifilmistiil.",
      "image": "char1.png"
    },
    {
      "id": "char2",
      "name": "PEETER",
      "type": "human",
      "description": "Väike inimene, poiss. Peeter on lahke poiss lühikeste pruunide juustega. Tal on seljas roheline sviiter ja pruunid püksid. Tema uudishimulikud silmad ja naeratav ilme näitavad rõõmsat meelt. Armas multifilmistiil.",
      "image": "char2.png"
    }
  ],
  "locations": [
    {
      "id": "loc1",
      "name": "Hubane lastetuba",
      "description": "Hubane lastetuba pehme kollase vaibaga. Keset tuba seisab suur puidust laud, millel on erinevad käsitöövahendid. Seintel rippuvad värvilised lastejoonistused. Akendest paistab talvine hämar valgus, luues sooja ja kutsuva atmosfääri. Multifilmistiil.",
      "image": "loc1.png"
    }
  ],
  "pages": [
    {
      "pageNumber": 1,
      "text": "MARI JA PEETER TOAS.",
      "scene": "Mari ja Peeter istuvad hubases lastetoas puidust laua ääres. Laual on hunnik värvilisi paberilehti, käärid ja liimipulk. Mari hoiab käes sinist paberilehte ja Peeter vaatab teda naeratades. Toas on soe ja kutsuv atmosfäär, aknast paistab talvine hämar valgus. Multifilmistiil.",
      "image": "page1.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 2,
      "text": "NEIL ON SUUR MÕTE.",
      "scene": "Mari ja Peeter istuvad rõõmsalt laua ääres, vahetades pilke ja naeratades. Mari hoiab käes erksavärvilist pabeririba ja Peeter osutab laual olevale värviliste paberite hunnikule. Nende näoilmed on elevust täis, justkui oleks neil suurepärane idee. Toas on palju värvilisi paberilehti, käärid ja liimipulk. Multifilmistiil.",
      "image": "page2.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 3,
      "text": "NAD TEEVAD KAUNEID KETTE.",
      "scene": "Mari ja Peeter istuvad laua ääres ja tegutsevad usinalt. Mari liimib kokku paberiribasid, et moodustada paberiketi lüli. Peeter hoiab käes juba valminud väikest värvilist paberiketi juppi ja vaatab seda imetlusega. Laual on laiali värvilised paberiribad ja liimipulk. Multifilmistiil.",
      "image": "page3.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 4,
      "text": "LÕIKAVAD PABERIT HOOLEGA.",
      "scene": "Mari ja Peeter on laua ääres keskendunult käsitööga ametis. Peeter hoiab ettevaatlikult kääre ja lõikab hoolikalt värvilisest paberist ribasid. Mari hoiab käes juba lõigatud paberiribasid. Laual on palju värvilisi paberijuppe ja kääre. Mõlemad on tõsised ja püüavad oma tööd hästi teha. Multifilmistiil.",
      "image": "page4.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 5,
      "text": "LIIMIVAD OSAD KOKKU.",
      "scene": "Mari ja Peeter tegutsevad laua taga. Mari hoiab liimipulka ja liimib kokku kahte värvilist pabeririba, et moodustada paberiketi lüli. Peeter jälgib teda huviga, hoides käes järgmist pabeririba. Laual on valmimas paberikett ja laiali on erinevaid paberitükke. Multifilmistiil.",
      "image": "page5.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 6,
      "text": "KETID ON VÄRVILISED.",
      "scene": "Mari ja Peeter on uhked oma saavutuse üle. Nad hoiavad mõlemad käes pikki, säravaid ja värvilisi paberikette, mis koosnevad paljudest kokkuliimitud lülidest. Kettidel on eri värvi paberid – punane, sinine, roheline, kollane. Nende näod säravad rõõmust. Laual on näha veel käsitööjääke. Multifilmistiil.",
      "image": "page6.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 7,
      "text": "TOAS TULEB SÄRA.",
      "scene": "Mari ja Peeter vaatavad rõõmsalt ringi oma toas. Mõned värvilised paberiketid on juba seinale või akna külge riputatud, tuues tuppa helgust ja sära. Üks kett on Peetri käes ja Mari osutab naeratades riputatud ketile. Toas on helge ja pidulik meeleolu. Multifilmistiil.",
      "image": "page7.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 8,
      "text": "PEETER RIPUTAB KETID.",
      "scene": "Peeter seisab väikese tooli peal ja riputab üles viimast värvilist paberiketti. Mari seisab tema kõrval ja annab talle käest järgmise keti. Toa seinad on juba kaunistatud mitme paberiketiga, mis loovad rõõmsa ja piduliku õhkkonna. Peeter ulatub akna või seina poole, et kett kinnitada. Multifilmistiil.",
      "image": "page8.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 9,
      "text": "NAD OOTAVAD UUT AASTAT.",
      "scene": "Mari ja Peeter seisavad oma kaunistatud toas, käest kinni hoides ja aknast välja vaadates. Aknast paistab talvine öö. Toas on rippuvad värvilised paberiketid. Nende näod on täis ootust ja elevust, nad vaatavad tulevikku ja rõõmustavad saabuvate pühade üle. Multifilmistiil.",
      "image": "page9.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 10,
      "text": "MARI JA PEETER NAERATAVAD.",
      "scene": "Mari ja Peeter seisavad kõrvuti oma ilusti kaunistatud toas, käed rõõmsalt külgedel või käest kinni hoides. Nad vaatavad otse vaatleja poole ja naeratavad laialt, rahulolevalt oma tehtud töö ja piduliku meeleolu üle. Toas on näha kõik valminud värvilised paberiketid. Mõlemad on väga õnnelikud. Multifilmistiil.",
      "image": "page10.png",
      "location_id": "loc1"
    }
  ]
}