{
  "date": "2026-02-01",
  "language": "et",
  "title": "JÄNES JA ORAV EHITAVAD MAJA",
  "generatedAt": "2026-01-25T22:14:15.721Z",
  "characters": [
    {
      "id": "char1",
      "name": "JÄNES SALL",
      "type": "rabbit",
      "description": "Väike valge jänes, pikad kõrvad, seljas pehme sinine kampsun ja kaelas väike punane sall. Suured sõbralikud silmad ja rõõmus näoilme. Armas multifilmistiil.",
      "image": "char1.png"
    },
    {
      "id": "char2",
      "name": "ORAV OSS",
      "type": "squirrel",
      "description": "Väike oranž orav, kohev saba, seljas roheline vest ja peas väike pruun müts. Suured uudishimulikud silmad ja mänguline naeratus. Armas multifilmistiil.",
      "image": "char2.png"
    }
  ],
  "locations": [
    {
      "id": "loc1",
      "name": "Hubane lastetuba",
      "description": "Cozy children's room with light yellow walls and a warm wooden floor. There is a large single window on the back wall, showing a snowy winter landscape outside with bare trees. A simple blue rug is on the floor in the center. A small wooden toy box is against the right wall. The room is tidy and filled with soft, warm light from the window. Cartoon style.",
      "image": "loc1.png"
    }
  ],
  "pages": [
    {
      "pageNumber": 1,
      "text": "JÄNES JA ORAV TOAS.",
      "scene": "Jänes Sall and Orav Oss are standing in the middle of a cozy children's room, looking around. Jänes Sall has its paws together in front of it, and Orav Oss is tapping its chin thoughtfully. The room has light yellow walls, a wooden floor, a blue rug in the center, a wooden toy box on the right, and a window showing snowy trees. They wear their consistent clothing.",
      "image": "page1.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 2,
      "text": "VÄLJAS ON KÜLM TALV.",
      "scene": "Jänes Sall and Orav Oss are standing by the window of the cozy children's room, looking out at the snowy winter landscape with bare trees. They both shiver slightly and pull their sweaters/vests tighter, making a 'brrr' gesture. The room has light yellow walls, a wooden floor, a blue rug in the center, and a wooden toy box on the right. They wear their consistent clothing.",
      "image": "page2.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 3,
      "text": "TEEME KOOS MAJA.",
      "scene": "Jänes Sall and Orav Oss are smiling at each other in the cozy children's room. Jänes Sall claps its paws together excitedly, and Orav Oss points an excited paw up, suggesting an idea. The room has light yellow walls, a wooden floor, a blue rug in the center, a wooden toy box on the right, and a window showing snowy trees. They wear their consistent clothing.",
      "image": "page3.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 4,
      "text": "NAD OTSIVAD TEKKE.",
      "scene": "Jänes Sall and Orav Oss are looking into the slightly open wooden toy box in the cozy children's room. Jänes Sall is reaching inside, and Orav Oss is peering over its shoulder, both looking curious and determined. The room has light yellow walls, a wooden floor, a blue rug in the center, and a window showing snowy trees. They wear their consistent clothing.",
      "image": "page4.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 5,
      "text": "NAD LEIAVAD PADJAD.",
      "scene": "Jänes Sall and Orav Oss are each holding a soft, colorful pillow. Jänes Sall holds a blue pillow, and Orav Oss holds a green pillow. They are smiling happily at each other in the cozy children's room. The room has light yellow walls, a wooden floor, a blue rug in the center, a wooden toy box on the right, and a window showing snowy trees. They wear their consistent clothing.",
      "image": "page5.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 6,
      "text": "NAD EHITAVAD MAJA.",
      "scene": "Jänes Sall and Orav Oss are actively building a fort in the middle of the cozy children's room. They are holding up a large colorful blanket together, trying to drape it over some stacked pillows. The room has light yellow walls, a wooden floor, a blue rug in the center, a wooden toy box on the right, and a window showing snowy trees. They wear their consistent clothing.",
      "image": "page6.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 7,
      "text": "MAJA ON PEHME.",
      "scene": "The blanket fort is now mostly built in the middle of the cozy children's room. It's a soft, inviting structure made of colorful blankets and pillows. Jänes Sall is gently patting the side of the blanket fort, and Orav Oss is looking at it with a satisfied smile. The room has light yellow walls, a wooden floor, a blue rug in the center, a wooden toy box on the right, and a window showing snowy trees. They wear their consistent clothing.",
      "image": "page7.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 8,
      "text": "NAD LÄHEVAD MAJJA.",
      "scene": "Jänes Sall and Orav Oss are carefully crawling into the opening of the blanket fort in the middle of the cozy children's room. They are both smiling, looking excited to enter their newly built fort. The room has light yellow walls, a wooden floor, a blue rug in the center, a wooden toy box on the right, and a window showing snowy trees. They wear their consistent clothing.",
      "image": "page8.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 9,
      "text": "MAJA ON SOE JA HEA.",
      "scene": "Jänes Sall and Orav Oss are inside the cozy blanket fort, which is made of colorful blankets and pillows. They are sitting comfortably on the pillows, looking warm and happy. Jänes Sall has its paws resting on its lap, and Orav Oss is leaning against a pillow. A peek of the cozy children's room with its light yellow walls and wooden floor is visible outside the fort opening. They wear their consistent clothing.",
      "image": "page9.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 10,
      "text": "SÕBRAD ON ÕNNELIKUD.",
      "scene": "Jänes Sall and Orav Oss are still inside the cozy blanket fort, made of colorful blankets and pillows. They are snuggled together, laughing and giving each other a friendly high-five. The interior of the fort looks very comfortable and inviting, with soft light. A peek of the cozy children's room with its light yellow walls and wooden floor is visible outside the fort opening. They wear their consistent clothing.",
      "image": "page10.png",
      "location_id": "loc1"
    }
  ]
}