{
  "date": "2025-12-25",
  "language": "et",
  "title": "MARI JA JUKU PIKNIKUL",
  "generatedAt": "2025-12-24T22:15:29.020Z",
  "characters": [
    {
      "id": "char1",
      "name": "MARI",
      "type": "human",
      "description": "Väike inimene, rõõmsameelne tüdruk. Tal on heledad põsepikkused juuksed ja suured sinised silmad. Mari kannab erekollast kleiti ja roosasid kingi. Tema naeratus on alati soe ja sõbralik. Armas multifilmistiil.",
      "image": "char1.png"
    },
    {
      "id": "char2",
      "name": "JUKU",
      "type": "human",
      "description": "Väike inimene, energiline ja rõõmus poiss. Tal on lühikesed pruunid juuksed ja pruunid uudishimulikud silmad. Juku kannab helesinist t-särki ja rohelisi lühikesi pükse, jalas on punased tossud. Ta on alati abivalmis ja naerusuine. Armas multifilmistiil.",
      "image": "char2.png"
    }
  ],
  "locations": [
    {
      "id": "loc1",
      "name": "HUBANE KÖÖK",
      "description": "Valgusküllane ja hubane köök. Seal on puidust laud, mõned toolid, heledad kapid ja suur aken, kust paistab sisse päike. Aknalaual on väike potilill. Atmosfäär on soe ja kutsuv. Multifilmistiil.",
      "image": "loc1.png"
    },
    {
      "id": "loc2",
      "name": "PÄIKESELINE PARK",
      "description": "Suur roheline park päikeselisel päeval. Seal on kõrged rohelised puud, pehme rohi ja mõned värvilised lilled. Taevas on selge sinine, mõne valge pilvega. Üldine atmosfäär on rahulik ja rõõmus. Multifilmistiil.",
      "image": "loc2.png"
    }
  ],
  "pages": [
    {
      "pageNumber": 1,
      "text": "MARI JA JUKU ON KÖÖGIS.",
      "scene": "Mari ja Juku seisavad rõõmsalt köögis, vaatavad teineteisele otsa, käed puusal, mõtlikud ilmed. Köögis on heledat puitu ja palju valgust. Nad ootavad oma järgmist seiklust. LANDSCAPE composition.",
      "image": "page1.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 2,
      "text": "NEIL ON MÕTE.",
      "scene": "Mari ja Juku naeratavad laialt teineteisele köögis, silmad säravad, justkui neile oleks äsja pähe tulnud midagi toredat. Nad hoiavad käest kinni. LANDSCAPE composition.",
      "image": "page2.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 3,
      "text": "NAD PLAANIVAD PIKNIKKU.",
      "scene": "Mari ja Juku osutavad rõõmsalt köögilauale, kus on mõned toiduained: leib, juust ja õunad. Nad on elevil. LANDSCAPE composition.",
      "image": "page3.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 4,
      "text": "VALMISTAVAD VÕILEIBU.",
      "scene": "Mari ja Juku seisavad köögilaua taga, lõikavad mängult ohutute plastnoaga leiba ja juustu. Nad on keskendunud ja rõõmsad, valmistades võileibu. LANDSCAPE composition.",
      "image": "page4.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 5,
      "text": "PAKIVAD KORVI.",
      "scene": "Mari ja Juku panevad valmis võileibu ja värvilisi puuvilju (näiteks punaseid õunu ja kollaseid banaane) suurde pruuni piknikukorvi. Korv on peaaegu täis. LANDSCAPE composition.",
      "image": "page5.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 6,
      "text": "LÄHVAD PARKI.",
      "scene": "Mari ja Juku kõnnivad rõõmsalt päikeselises pargis rohelise muru peal. Jukul on käes piknikukorv, Mari naeratab tema kõrval. Nad vaatavad ootusärevalt ettepoole. LANDSCAPE composition.",
      "image": "page6.png",
      "location_id": "loc2"
    },
    {
      "pageNumber": 7,
      "text": "LAOTAVAD TEKI MAHA.",
      "scene": "Mari ja Juku laotavad pargi rohelisel murul maha värvilise ruudulise piknikuteki. Nad on hoos ja teevad seda koos. LANDSCAPE composition.",
      "image": "page7.png",
      "location_id": "loc2"
    },
    {
      "pageNumber": 8,
      "text": "SÖÖVAD MAITSVAT SÖÖKI.",
      "scene": "Mari ja Juku istuvad rõõmsalt piknikutekil rohelises pargis. Nad söövad oma valmis võileibu ja naeravad koos. Päike paistab soojalt. LANDSCAPE composition.",
      "image": "page8.png",
      "location_id": "loc2"
    },
    {
      "pageNumber": 9,
      "text": "PÄIKE PAISTAB.",
      "scene": "Mari ja Juku on just söömise lõpetanud, vaatavad üles sinisesse taevasse, kus paistab erekollane päike. Nende näod on rahulolevad ja õnnelikud. LANDSCAPE composition.",
      "image": "page9.png",
      "location_id": "loc2"
    },
    {
      "pageNumber": 10,
      "text": "NEIL ON LÕBUS",
      "scene": "Mari ja Juku kallistavad rõõmsalt teineteist piknikutekil pargis. Nende ümber on kaunis roheline loodus ja nad on väga õnnelikud. LANDSCAPE composition.",
      "image": "page10.png",
      "location_id": "loc2"
    }
  ]
}