{
  "date": "2026-01-25",
  "language": "et",
  "title": "MARI JA MIILU TÄHED",
  "generatedAt": "2026-01-18T22:12:05.950Z",
  "characters": [
    {
      "id": "char1",
      "name": "MARI",
      "type": "human",
      "description": "Väike inimene, helepruunide juustega tüdruk. Seljas on roosa kampsun ja sinised püksid. Tal on suured rõõmsad silmad ja sõbralik nägu. Armas multifilmistiil.",
      "image": "char1.png"
    },
    {
      "id": "char2",
      "name": "MIILU",
      "type": "human",
      "description": "Väike inimene, lühikeste tumepruunide juustega poiss. Seljas on sinine kampsun ja hallid püksid. Tal on säravad silmad ja uudishimulik naeratus. Armas multifilmistiil.",
      "image": "char2.png"
    }
  ],
  "locations": [
    {
      "id": "loc1",
      "name": "Lastetuba",
      "description": "Children's cozy bedroom with light blue painted walls, a soft gray carpet, a single window on the back wall showing dark winter trees and a few snowflakes gently falling, a small light wooden round table in the center, and two small wooden chairs. A yellow star-shaped night light is on a small shelf on the right wall. Warm and inviting atmosphere. Cartoon style.",
      "image": "loc1.png"
    }
  ],
  "pages": [
    {
      "pageNumber": 1,
      "text": "MARI JA MIILU TOAS.",
      "scene": "Mari and Miilu are in a children's cozy bedroom. Mari sits on a small wooden chair at a small light wooden round table, smiling. Miilu stands next to her, looking at her with a happy expression. The room has light blue painted walls, a soft gray carpet, and a single window on the back wall showing dark winter trees and a few snowflakes gently falling. A yellow star-shaped night light is on a small shelf on the right wall. Cute cartoonish children's book illustration style, bright cheerful colors, soft rounded shapes, friendly and inviting atmosphere, simple clean backgrounds, appealing to young children. LANDSCAPE composition.",
      "image": "page1.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 2,
      "text": "ON KOHE ÕHTU KÄES.",
      "scene": "Mari and Miilu are still in their cozy bedroom. Mari sits on a small wooden chair at a small light wooden round table, looking out the window with a thoughtful expression. Miilu stands next to her, also looking towards the window. Through the single window on the back wall, dark winter trees are visible, and more snowflakes gently fall. The room has light blue painted walls, a soft gray carpet, and a yellow star-shaped night light on a small shelf on the right wall. Cute cartoonish children's book illustration style, bright cheerful colors, soft rounded shapes, friendly and inviting atmosphere, simple clean backgrounds, appealing to young children. LANDSCAPE composition.",
      "image": "page2.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 3,
      "text": "NEIL ON HEA MÕTE.",
      "scene": "Mari and Miilu are in their cozy bedroom. Mari sits on a small wooden chair at a small light wooden round table, looking at Miilu with a big, excited smile. Miilu stands next to her, looking happy and nodding, suggesting an idea. The room has light blue painted walls, a soft gray carpet, and a single window on the back wall showing dark winter trees and a few snowflakes gently falling. A yellow star-shaped night light is on a small shelf on the right wall. Cute cartoonish children's book illustration style, bright cheerful colors, soft rounded shapes, friendly and inviting atmosphere, simple clean backgrounds, appealing to young children. LANDSCAPE composition.",
      "image": "page3.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 4,
      "text": "TEEME ILUSAID TÄHTI.",
      "scene": "Mari and Miilu are in their cozy bedroom. Mari sits on a small wooden chair at a small light wooden round table, pointing excitedly at the table. Miilu sits on the other small wooden chair opposite her, looking at Mari with a happy, eager expression. The room has light blue painted walls, a soft gray carpet, and a single window on the back wall showing dark winter trees and a few snowflakes gently falling. A yellow star-shaped night light is on a small shelf on the right wall. Cute cartoonish children's book illustration style, bright cheerful colors, soft rounded shapes, friendly and inviting atmosphere, simple clean backgrounds, appealing to young children. LANDSCAPE composition.",
      "image": "page4.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 5,
      "text": "NAD VÕTAVAD PABERIT.",
      "scene": "Mari and Miilu are in their cozy bedroom. Mari sits on a small wooden chair at a small light wooden round table, holding a stack of colorful, shimmering paper sheets in her hands, smiling. Miilu sits opposite her, reaching out to take a sheet of paper. The room has light blue painted walls, a soft gray carpet, and a single window on the back wall showing dark winter trees and a few snowflakes gently falling. A yellow star-shaped night light is on a small shelf on the right wall. Cute cartoonish children's book illustration style, bright cheerful colors, soft rounded shapes, friendly and inviting atmosphere, simple clean backgrounds, appealing to young children. LANDSCAPE composition.",
      "image": "page5.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 6,
      "text": "PABER LÄIGIB NÜÜD.",
      "scene": "Mari and Miilu are in their cozy bedroom. Mari sits on a small wooden chair at a small light wooden round table, gently applying glitter glue onto a colorful piece of paper, which is now sparkling. Miilu sits opposite her, holding another piece of paper and a small container of glitter, smiling. Various craft supplies like colorful paper and glitter are spread on the table. The room has light blue painted walls, a soft gray carpet, and a single window on the back wall showing dark winter trees and a few snowflakes gently falling. A yellow star-shaped night light is on a small shelf on the right wall. Cute cartoonish children's book illustration style, bright cheerful colors, soft rounded shapes, friendly and inviting atmosphere, simple clean backgrounds, appealing to young children. LANDSCAPE composition.",
      "image": "page6.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 7,
      "text": "NAD LÕIKAVAD TÄHED VÄLJA.",
      "scene": "Mari and Miilu are in their cozy bedroom. Mari sits on a small wooden chair at a small light wooden round table, carefully cutting a star shape from a piece of sparkling paper with child-safe scissors. Miilu sits opposite her, holding a finished cut-out paper star, looking at it proudly. Colorful paper scraps and craft supplies are on the table. The room has light blue painted walls, a soft gray carpet, and a single window on the back wall showing dark winter trees and a few snowflakes gently falling. A yellow star-shaped night light is on a small shelf on the right wall. Cute cartoonish children's book illustration style, bright cheerful colors, soft rounded shapes, friendly and inviting atmosphere, simple clean backgrounds, appealing to young children. LANDSCAPE composition.",
      "image": "page7.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 8,
      "text": "TÄHED ON NII ILUSAD!",
      "scene": "Mari and Miilu are in their cozy bedroom. Mari and Miilu are both sitting at the small light wooden round table, admiring several beautiful, colorful, sparkling paper stars laid out on the table. They are both smiling brightly, looking at their creations. The room has light blue painted walls, a soft gray carpet, and a single window on the back wall showing dark winter trees and a few snowflakes gently falling. A yellow star-shaped night light is on a small shelf on the right wall. Cute cartoonish children's book illustration style, bright cheerful colors, soft rounded shapes, friendly and inviting atmosphere, simple clean backgrounds, appealing to young children. LANDSCAPE composition.",
      "image": "page8.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 9,
      "text": "NAD PANEVAAD TÄHED ÜLES.",
      "scene": "Mari and Miilu are in their cozy bedroom. Mari stands on a small stool next to the light blue wall, carefully hanging a string of paper stars on the wall with tape. Miilu stands below her, holding up more paper stars to give to Mari, looking up excitedly. The light wooden round table is nearby. The room has light blue painted walls, a soft gray carpet, and a single window on the back wall showing dark winter trees and a few snowflakes gently falling. A yellow star-shaped night light is on a small shelf on the right wall. Cute cartoonish children's book illustration style, bright cheerful colors, soft rounded shapes, friendly and inviting atmosphere, simple clean backgrounds, appealing to young children. LANDSCAPE composition.",
      "image": "page9.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 10,
      "text": "TOAS ON PALJU VALGUST.",
      "scene": "Mari and Miilu are in their cozy bedroom. Mari and Miilu are standing together, admiring the numerous colorful, sparkling paper stars they have hung on the light blue walls. The stars gently shimmer. Both children are smiling happily. The room is softly illuminated by the star decorations and the yellow star-shaped night light on a small shelf on the right wall. The single window on the back wall shows the dark winter trees and snowflakes still gently falling. The light wooden round table and two small wooden chairs are visible. Cute cartoonish children's book illustration style, bright cheerful colors, soft rounded shapes, friendly and inviting atmosphere, simple clean backgrounds, appealing to young children. LANDSCAPE composition.",
      "image": "page10.png",
      "location_id": "loc1"
    }
  ]
}