{
  "date": "2026-01-23",
  "language": "et",
  "title": "ORAV OLLI TALVINE MÄNG",
  "generatedAt": "2026-01-12T01:11:17.072Z",
  "characters": [
    {
      "id": "char1",
      "name": "ORAV OLLI",
      "type": "squirrel",
      "description": "Väike pruun orav koheva sabaga, seljas soe roheline sall ja pisikesed pruunid kindad, suured säravad uudishimulikud silmad. Armas multifilmistiil.",
      "image": "char1.png"
    },
    {
      "id": "char2",
      "name": "JÄNES JENNI",
      "type": "rabbit",
      "description": "Väike valge jänes pikkade kõrvadega, jalas sinised paksud saapad ja soe sinine müts, naeratab sõbralikult. Armas multifilmistiil.",
      "image": "char2.png"
    }
  ],
  "locations": [
    {
      "id": "loc1",
      "name": "Lumise metsaäär",
      "description": "A serene, snow-covered forest edge in winter. The ground is covered in deep, pristine white snow. Tall pine and spruce trees, heavily laden with snow, line the background. A few bare deciduous trees with delicate snow-covered branches are also visible. The sky is a soft, light blue with gentle white clouds. The overall atmosphere is peaceful, bright, and calm. Cartoonish style with soft rounded shapes.",
      "image": "loc1.png"
    }
  ],
  "pages": [
    {
      "pageNumber": 1,
      "text": "ORAV OLLI JA JÄNES JENNI.",
      "scene": "Orav Olli, a small brown squirrel with a bushy tail, wearing a warm green scarf and tiny brown mittens, stands next to Jänes Jenni, a small white rabbit with long ears, wearing thick blue boots and a warm blue hat. They are both standing at the very edge of a pristine, snow-covered forest. The ground is deep in white snow. They are looking at the snowy landscape with wide, excited eyes. Tall pine trees heavy with snow are in the background. Cartoon style.",
      "image": "page1.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 2,
      "text": "ÕUES ON PALJU LUND.",
      "scene": "Orav Olli and Jänes Jenni are standing in the deep, fresh snow at the forest edge. Olli points with a mittened paw at the vast expanse of snow. Jenni looks at the snow with a happy, surprised expression. The snow is pristine and untouched around them. Tall pine trees heavy with snow are in the background. Cartoon style.",
      "image": "page2.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 3,
      "text": "NAD ASTUVAD LUME SISSE.",
      "scene": "Orav Olli and Jänes Jenni are carefully stepping into the deep, fresh snow, leaving their first footprints. Olli lifts one mittened paw high, about to place it down. Jenni is already sinking slightly into the snow with her blue boots. They both have joyful and curious expressions. Tall pine trees heavy with snow are in the background. Cartoon style.",
      "image": "page3.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 4,
      "text": "NAD MAITSVAD LUND.",
      "scene": "Orav Olli and Jänes Jenni are both bending down playfully. Olli has a tiny bit of snow on his mittened paw, bringing it towards his mouth with a curious expression. Jenni has a small amount of snow on her blue-gloved hand and is also looking at it curiously, about to taste. The snow around them is still deep and white. Tall pine trees heavy with snow are in the background. Cartoon style.",
      "image": "page4.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 5,
      "text": "NAD TEEVAD LUMES RADU.",
      "scene": "Orav Olli and Jänes Jenni are walking happily through the deep snow, leaving a clear path of footprints behind them. Olli is walking in front, Jenni follows closely. They are both smiling and looking at the path they are creating. Tall pine trees heavy with snow are in the background. Cartoon style.",
      "image": "page5.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 6,
      "text": "OLLI HÜPPAB LUME SISSE.",
      "scene": "Orav Olli is mid-air, playfully jumping into a particularly deep drift of snow, creating a small puff of snow around him. He looks excited and joyful. Jänes Jenni stands nearby, watching Olli with an amused and happy expression. Tall pine trees heavy with snow are in the background. Cartoon style.",
      "image": "page6.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 7,
      "text": "JENNI NAERAB RÕÕMSALT.",
      "scene": "Jänes Jenni is standing, looking at Orav Olli, who is partially submerged in the snow from his jump, peeking out with a playful grin. Jenni is laughing happily, her ears slightly perked. Tall pine trees heavy with snow are in the background. Cartoon style.",
      "image": "page7.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 8,
      "text": "MÄNG ON NII LÕBUS.",
      "scene": "Orav Olli and Jänes Jenni are side-by-side, standing in the snow. Olli has a playful snowball in his mittened paw (not throwing, just holding). Jenni is looking at him with a big, happy smile. They both look content and joyful. The created path is visible in the background. Tall pine trees heavy with snow are in the background. Cartoon style.",
      "image": "page8.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 9,
      "text": "NAD ON VÄGA SÕBRAD.",
      "scene": "Orav Olli and Jänes Jenni are standing close together in the snow. Olli gently pats Jenni's arm with his mittened paw. Jenni leans slightly towards Olli, and they are both smiling at each other warmly, showing affection and friendship. Tall pine trees heavy with snow are in the background. Cartoon style.",
      "image": "page9.png",
      "location_id": "loc1"
    },
    {
      "pageNumber": 10,
      "text": "TALV ON NII TORE.",
      "scene": "Orav Olli and Jänes Jenni are sitting together in the snow, leaning against each other slightly. They both have peaceful, content, and happy expressions, looking up at the sky, enjoying the beautiful winter day with a few gentle snowflakes falling. Tall pine trees heavy with snow are in the background. Cartoon style.",
      "image": "page10.png",
      "location_id": "loc1"
    }
  ]
}